#+TITLE:More concise results from Mldoc
#+DATE:2021-09-11

目前Mldoc无法处理比较复杂的orgmode场景，比如下面的几个例子，某些隶属于相应子元素的属性全被解析到了page级别，渲染效果不是很理想。按照我的想法，如果可以实现下面的解析结果，不但可以实现各个元素更细致的显示和控制，而且更长远的场景，比如表格计算，对齐等都成为了可能。

其实我不是很清楚实现的难度，还有对性能会产生什么的影响。你们帮忙看看，如果可以实现的话，后面的元素显示还有扩展功能的话交给我来做。

除了下面的几个解析，还希望能暴露重要元素的 =:start_pos, :end_pos= 给logseq，比如link, 这样就可以在编辑状态下更容易实现快捷键打开链接等，而不需要先退出编辑状态等待渲染后再打开。等等。

* TODO 1. 表格
:PROPERTIES:
:created_at: <2021-09-11 Sat 19:30>
:END:

#+caption: Table caption
#+name: table_name
| Name  | number | cost per item |      sum | incl VAT |
|-------+--------+---------------+----------+----------|
| name1 |      3 |       1500.00 |  4500.00 |  4860.00 |
| name2 |      9 |       4000.00 | 36000.00 | 38880.00 |
| name3 |      4 |       2800.00 | 11200.00 | 12096.00 |
|-------+--------+---------------+----------+----------|
| Total |        |               | 51700.00 | 55836.00 |
#+TBLFM: @>$4..@>$>=vsum(@I..@II);%.2f::@2$4..@4$4=$2*$3;%.2f::@2$5..@4$5=$4*1.08;%.2f

* TODO 3. 代码块
:PROPERTIES:
:created_at: <2021-09-11 Sat 23:00>
:END:
#+NAME: source_block
#+header: :var x=2 y=3 
#+BEGIN_SRC emacs-lisp :var z=4 :results line
(* 2 x y z)
#+END_SRC

#+RESULTS: mydouble
: 48

